 
!
#
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
]
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
~
¥
々
あ
い
う
ぇ
え
お
か
が
き
ぎ
く
ぐ
け
げ
こ
ご
さ
ざ
し
じ
す
ず
せ
そ
ぞ
た
だ
ち
っ
つ
づ
て
で
と
ど
な
に
ぬ
ね
の
は
ば
ひ
び
ふ
ぶ
べ
ほ
ぼ
ぽ
ま
み
む
め
も
ゃ
や
ゆ
ょ
よ
ら
り
る
れ
ろ
わ
を
ん
゙
゚
ァ
ア
ィ
イ
ゥ
ウ
ェ
エ
ォ
オ
カ
ガ
キ
ギ
ク
グ
ケ
ゲ
コ
ゴ
サ
ザ
シ
ジ
ス
ズ
セ
ゼ
ソ
ゾ
タ
ダ
チ
ヂ
ッ
ツ
ヅ
テ
デ
ト
ド
ナ
ニ
ヌ
ネ
ノ
ハ
バ
パ
ヒ
ビ
ピ
フ
ブ
プ
ヘ
ベ
ペ
ホ
ボ
ポ
マ
ミ
ム
メ
モ
ャ
ヤ
ュ
ユ
ョ
ヨ
ラ
リ
ル
レ
ロ
ワ
ン
ヴ
ヶ
・
一
丁
七
万
三
上
下
不
与
世
丘
丙
両
並
中
串
丸
丹
主
乃
久
之
乙
九
乳
亀
予
亊
事
二
互
五
井
亜
交
京
亭
人
仁
今
介
仏
付
仙
代
仮
仲
任
企
伊
伎
伏
会
伝
伯
伸
似
佃
住
佐
体
余
作
依
便
保
信
俣
修
倉
倍
借
倶
偕
健
側
備
働
優
元
先
光
免
児
兜
入
全
八
公
六
共
兵
具
兼
内
円
再
写
冨
冶
冷
出
函
刀
分
切
刈
初
別
利
到
刷
券
前
剛
剤
割
創
劇
力
加
助
労
勇
動
務
勝
勢
勧
勿
匂
包
化
北
匝
匠
区
医
十
千
半
卒
協
南
博
占
卯
印
卸
厚
原
参
又
友
双
反
取
受
口
古
可
台
右
号
司
各
合
吉
同
名
吐
向
君
吹
吾
呂
呉
告
周
味
呼
命
和
咲
品
員
唐
商
問
善
喜
喰
営
嘉
器
四
団
国
國
園
土
在
地
坂
坊
坪
垂
型
垣
城
域
基
埼
堀
堂
堅
堤
堰
報
場
堺
塗
塚
塩
塾
境
墓
増
墨
壁
壗
士
壬
壱
売
夏
夕
外
多
夜
夢
大
天
太
夫
央
奇
奈
奉
奥
女
好
妙
妻
姥
姫
威
婁
婦
媛
子
字
孝
季
学
孫
宅
宇
守
安
宏
宕
宗
官
宙
定
宜
宝
実
客
室
宮
害
家
容
宿
寄
密
富
寒
寝
寮
寺
寿
専
射
尊
小
尻
尼
尽
尾
局
居
屋
属
山
岐
岡
岩
岬
岱
岳
岸
峠
峯
峰
島
崎
嶋
嶺
川
州
巣
工
左
差
巳
巻
巽
市
布
希
帝
師
帯
常
帽
幅
幌
幕
幡
幣
干
平
年
幸
庁
広
庄
店
府
座
庫
庭
庵
康
廣
延
建
廿
弁
式
弐
弓
引
弘
弥
張
当
形
彦
彩
影
彼
待
律
後
御
徳
心
忍
志
忠
念
忽
急
恒
恩
恵
悠
悪
情
惣
愛
慈
慣
慶
懸
成
我
戸
房
所
扇
手
才
打
技
折
押
拓
拾
持
指
振
挽
掛
採
推
揚
援
損
携
摂
摩
摺
撫
播
支
改
放
政
教
敦
整
敷
文
斉
斎
斐
斗
料
斧
新
方
於
施
旅
旗
旙
日
旦
早
旭
昇
昌
明
易
星
春
昭
是
時
晃
景
晴
智
暁
暮
曇
曙
曲
曳
更
書
曽
曾
替
最
會
月
有
服
望
朝
木
未
末
本
札
朱
杉
杏
材
村
杜
束
条
来
東
杵
松
板
析
林
枚
果
枝
枡
柄
柏
染
柚
柳
柴
査
柿
栃
栄
栖
栗
校
株
根
桂
桃
桐
桑
桔
桜
桶
梅
梗
條
梨
械
梶
棚
棟
森
椋
植
椎
検
椥
椿
楠
楡
楢
業
極
楽
榎
榛
榮
榴
構
様
槻
樋
模
権
横
樫
樹
樺
樽
橋
橘
機
橿
櫛
欠
次
歌
止
正
此
武
歯
歳
段
殻
殿
母
比
毛
氏
民
気
水
氷
永
氾
汐
江
池
沓
沖
沢
河
油
治
沼
泉
泊
法
波
泥
泰
洋
洗
洞
津
洲
活
流
浄
浅
浜
浦
浪
浮
海
消
淀
淡
深
淵
添
清
済
渋
渕
渚
渡
温
測
港
湊
湖
湘
湛
湯
湾
満
源
溝
滋
滑
滝
漁
潟
潮
澄
澤
濁
濃
濤
濱
瀬
灘
火
災
烏
無
然
焼
照
熊
熱
燃
燕
父
爺
片
版
牛
牟
牡
牧
物
特
犬
狛
狩
独
狭
狼
猛
猪
猫
猿
玄
玉
王
珂
珠
現
球
理
琉
琴
瑞
瑠
瑳
璃
環
瓜
瓦
甘
生
産
用
田
由
甲
男
町
画
界
畑
留
畜
畠
番
畿
病
療
発
登
白
百
的
皆
皮
皿
益
盛
盟
盤
目
直
相
県
眞
真
眼
着
督
矢
知
石
砂
研
砥
砧
破
砺
硝
碑
碧
磐
磨
磯
礼
社
祇
祉
祐
祖
神
祥
祭
福
秀
秋
科
秦
秩
税
稜
種
稲
穀
穂
積
穴
究
空
窪
竈
立
竜
童
竪
端
竹
竿
笛
笠
笥
第
笹
等
筋
筑
筒
筬
箕
算
管
箪
箱
築
篠
篭
米
籾
粕
粟
精
糀
糧
糸
紀
紅
紋
納
紙
紡
紫
細
紺
組
経
結
絡
給
絹
継
続
綜
維
綱
網
綵
綾
綿
総
緑
線
練
縄
縫
繊
織
纏
置
美
群
義
羽
翁
習
翔
老
者
耕
耶
聖
聞
職
肉
肝
肥
育
胡
能
脇
脚
腰
膝
膳
臨
自
臼
興
舎
舗
舘
舞
舟
般
船
良
色
芋
芙
芝
芦
花
芳
芸
芹
芽
苅
苑
苗
若
苫
英
茂
茄
茅
茨
茶
草
荏
荒
荘
荷
荻
莱
菅
菊
菓
菖
菜
華
菱
萩
萬
萱
落
葉
葛
葦
葬
葵
葺
蒲
蒼
蓉
蓬
蓮
蔵
蕨
薙
薩
薬
薮
藍
藤
蘭
虎
虻
蛇
蛎
蝶
行
術
街
衛
衡
衣
表
袋
装
裏
製
裾
西
要
覇
見
親
観
角
觜
計
訓
記
訪
設
証
誉
語
誠
読
課
調
諏
諫
諸
警
議
護
谷
豆
豊
豪
貝
財
貨
販
貫
責
貴
貿
賀
資
赤
走
起
越
足
趾
路
蹟
車
軍
軒
軽
輝
輪
輸
辰
農
辺
辻
込
近
迦
迫
追
送
逆
透
逗
通
速
造
連
進
遊
運
道
達
遠
遣
邑
那
邦
郎
郡
部
郭
郵
郷
都
配
酒
釈
里
重
野
量
金
釜
針
釧
鈎
鈑
鈴
鉄
鉢
鉱
鉾
銀
銅
銘
銚
鋳
鋺
鋼
錦
録
鍋
鍛
鍬
鎌
鎗
鏡
鑑
長
門
開
間
関
閤
阜
阪
防
阿
陀
限
院
陣
陵
陶
陸
険
陽
隅
隆
隈
階
際
障
隠
隼
雀
雄
雅
集
雑
離
難
雨
雪
雲
電
霊
霞
霧
露
青
静
非
面
韮
音
頃
順
須
領
頭
額
類
風
飛
食
飯
飼
飽
飾
養
館
首
香
馬
駄
駅
駐
駒
駿
験
骨
高
髪
鬼
魚
鮎
鮒
鯖
鳥
鳩
鳳
鳴
鴛
鴨
鴫
鴬
鴻
鵜
鵠
鶏
鶯
鶴
鷲
鷹
鷺
鹿
麗
麹
麻
黒
鼻
齊
龍
﨑